import random

red = (1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35)
black = (2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36)
ych1 = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)
ych2 = (13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24)
ych3 =(25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36)

print(" _    _  _   _                      _        _    _         ")
print("| |  | || | | |                    | |      | |  | |        ")
print("| |  | || |_| | _ __   ___   _   _ | |  ___ | |_ | |_   ___ ")
print("| |/\| ||  _  || '__| / _ \ | | | || | / _ \| __|| __| / _ \'")
print("\  /\  /| | | || |   | (_) || |_| || ||  __/| |_ | |_ |  __/")
print(" \/  \/ \_| |_/|_|    \___/  \__,_||_| \___| \__| \__| \___|")

bal = 100 #баланс
print("Выберете режим")
print("(1)опр.число; (2)опр.цвет; (3)сразу несколько чисел (4)об игре и авторе")
print("       x7           x1.5                x2")

while True: #цикл "пока верно" чтобы игра не завершалась
    vib = input("Ваш выбор: ") #выбор игры или информации
    if bal <= 0:
        print("ты все слил")
        break
    if vib == "1":
        print("____________________________________")
        print("| |3 6 9 12|15 18 21 24|27 30 33 36|")
        print("|0|2 5 8 11|14 17 20 23|26 29 32 35|	x7")
        print("|_|1_4_7_10|13_16_19_22|25_28_31_34|")

        print("твой баланс =", bal,"MK")
        val = int(input("Ваша ставка: "))
        bal = bal-val #вычет из общего баланса
        numb = int(input("назови число от 0 до 36: "))
        die = random.randint(0, 36) #генерирует число от 0 до 36
        if numb == die:
            print("Ты победил:)")
            bal = bal+(val*7) #прибавление при выигрыше
        else:
            print("Ты проиграл:(")
        
    elif vib == "2":
        print("___________________________")
        print("| |к ч к к|ч к к ч|к к ч к|")
        print("|0|ч к ч ч|к ч ч к|ч ч к ч|	x1.5")
        print("|_|к_ч_к_ч|ч_к_к_ч|к_ч_ч_к|")
        print("		0 - зеро")
        print("		1 - красный")
        print("		2 - черный")
        print("твой баланс =", bal,"MK")
        val = int(input("Ваша ставка: "))
        bal = bal-val
        print("0 - зеро; 1 - красные; 2 - черные")
        numb = int(input("назови число от 0 до 2: "))
        die = random.randint(0, 36)
        if numb == 1:
            if die in red:
                print("Ты победил:)")
                bal = bal+(val*1.5)
            else:
                print("ты проиграл:(")
        elif numb == 2:
            if die in black:
                print("Ты победил:)")
                bal = bal+(val*1.5)
            else:
                print("ты проиграл:(")
        elif numb == 0:
            if die == 0:
                print("Джекпот")
                bal = bal+(val*3)
            else:
                print("ты проиграл:(")
        else:
            break
    elif vib == "3":
        print("____________________________________")
        print("| |3 6 9 12|15 18 21 24|27 30 33 36|")
        print("|0|2 5 8 11|14 17 20 23|26 29 32 35|	x2")
        print("|_|1_4_7_10|13_16_19_22|25_28_31_34|")
        print("  первая 12/ вторая 12 / третья 12 /")
        print("(0)  (1)       (2)           (3)")
        print("твой баланс =", bal,"MK")
        val = int(input("Ваша ставка: "))
        bal = bal-val
        print("0 - яч.зеро; 1 - первая яч.; 2 - вторая яч. 3 - третья яч.")
        numb = int(input("назови число от 0 до 3: "))
        die = random.randint(0, 36)
        if numb == 1:
            if die in ych1:
                print("Ты победил:)")
                bal = bal+(val*2)
            else:
                print("Ты проиграл:(")
        elif numb == 2:
            if die in ych2:
                print("Ты победил:)")
                bal = bal+(val*2)
            else:
                print("Ты проиграл:(")
        elif numb == 3:
            if die in ych3:
                print("Ты победил:)")
                bal = bal+(val*2)
            else:
                print("Ты проиграл:(")
        elif numb == 0:
            if die == 0:
                print("Джекпот)")
                bal = bal+(val*4)
            else:
                print("Ты проиграл:(")
        else:
            print("Пока")
            break
    elif vib == "4":
        print("Это игра созданна по прототипу 'Рулетки', но представленная в виде python скрипта.")
        print("Правила просты: выбераешь режим, ставку и число, а после надеешься на свою удачу.")
        print("Первый режим самый сложный, но и выигрыш составляет x7 от ставки.")
        print("Второй режим самый простой, но и выигрыш составляет x1.5 от ставки.")
        print("Третий - золотая середина, чуть сложнее второго, но имеет выигрыш х2 от ставки.")
        print("телега: @Sh1ka00")
        qt = input("Выход?")
        if qt == "Да":
            break
    else:
        print("Бай:)")
        break